; domain
;; Sokoban, in the STRIPS subset the fd_adapter parser accepts.
;; Generated by fixtures/sokoban.py -- do not edit by hand.
;;
;; `clear` covers the player as well as the boxes, so "a cell holds at most one
;; thing" is a consequence of the action set rather than an assumption a reader
;; has to supply.  The deadlock carver leans on exactly that: it derives the
;; at-most-one facts itself from reachable pairs, and never sees the board.
;;
;; `adj ?from ?to ?d` is static -- no action adds or deletes it -- which is what
;; lets grounding discard the pushes a wall makes impossible (DECISIONS D-016),
;; and in turn what makes a corner provable: a box in one has no push instance
;; left to delete its position.
(define (domain sokoban)
  (:requirements :strips :typing)
  (:types cell box dir)
  (:predicates
    (at-player ?c - cell)
    (at ?b - box ?c - cell)
    (clear ?c - cell)
    (adj ?from - cell ?to - cell ?d - dir))

  (:action move
    :parameters (?from - cell ?to - cell ?d - dir)
    :precondition (and (at-player ?from) (clear ?to) (adj ?from ?to ?d))
    :effect (and (at-player ?to) (not (at-player ?from))
                 (clear ?from) (not (clear ?to))))

  (:action push
    :parameters (?p - cell ?from - cell ?to - cell ?b - box ?d - dir)
    :precondition (and (at-player ?p) (at ?b ?from) (clear ?to)
                       (adj ?p ?from ?d) (adj ?from ?to ?d))
    :effect (and (at-player ?from) (not (at-player ?p)) (clear ?p)
                 (at ?b ?to) (not (at ?b ?from))
                 (not (clear ?to)) (not (clear ?from)))))

; problem
;; Sokoban level far4. Generated by fixtures/sokoban.py -- do not edit.
;;
;;   ######
;;   #....#
;;   #....#
;;   #....#
;;   #....#
;;   ######
;;
;; player c44; boxes b1@c22, b2@c33; goals b1@c42, b2@c13
(define (problem sokoban-far4)
  (:domain sokoban)
  (:objects
    c11 c12 c13 c14 c21 c22 c23 c24 c31 c32 c33 c34 c41 c42 c43 c44 - cell
    b1 b2 - box
    down left right up - dir)
  (:init
    (at-player c44)
    (at b1 c22)
    (at b2 c33)
    (clear c11)
    (clear c12)
    (clear c13)
    (clear c14)
    (clear c21)
    (clear c23)
    (clear c24)
    (clear c31)
    (clear c32)
    (clear c34)
    (clear c41)
    (clear c42)
    (clear c43)
    (adj c11 c21 down)
    (adj c11 c12 right)
    (adj c12 c22 down)
    (adj c12 c11 left)
    (adj c12 c13 right)
    (adj c13 c23 down)
    (adj c13 c12 left)
    (adj c13 c14 right)
    (adj c14 c24 down)
    (adj c14 c13 left)
    (adj c21 c31 down)
    (adj c21 c22 right)
    (adj c21 c11 up)
    (adj c22 c32 down)
    (adj c22 c21 left)
    (adj c22 c23 right)
    (adj c22 c12 up)
    (adj c23 c33 down)
    (adj c23 c22 left)
    (adj c23 c24 right)
    (adj c23 c13 up)
    (adj c24 c34 down)
    (adj c24 c23 left)
    (adj c24 c14 up)
    (adj c31 c41 down)
    (adj c31 c32 right)
    (adj c31 c21 up)
    (adj c32 c42 down)
    (adj c32 c31 left)
    (adj c32 c33 right)
    (adj c32 c22 up)
    (adj c33 c43 down)
    (adj c33 c32 left)
    (adj c33 c34 right)
    (adj c33 c23 up)
    (adj c34 c44 down)
    (adj c34 c33 left)
    (adj c34 c24 up)
    (adj c41 c42 right)
    (adj c41 c31 up)
    (adj c42 c41 left)
    (adj c42 c43 right)
    (adj c42 c32 up)
    (adj c43 c42 left)
    (adj c43 c44 right)
    (adj c43 c33 up)
    (adj c44 c43 left)
    (adj c44 c34 up))
  (:goal (and (at b1 c42) (at b2 c13))))

; plan
1. (move c44 c43 left)
   deleted: (at-player c44) (clear c43)
   added: (at-player c43) (clear c44)
   goals met: 0 of 2
2. (push c43 c33 c23 b2 up)
   deleted: (at-player c43) (at b2 c33) (clear c23)
   added: (at-player c33) (clear c43) (at b2 c23)
   goals met: 0 of 2
3. (push c33 c23 c13 b2 up)
   deleted: (at-player c33) (at b2 c23) (clear c13)
   added: (at-player c23) (clear c33) (at b2 c13)
   goals met: 1 of 2
4. (move c23 c33 down)
   deleted: (at-player c23) (clear c33)
   added: (at-player c33) (clear c23)
   goals met: 1 of 2
5. (move c33 c32 left)
   deleted: (at-player c33) (clear c32)
   added: (at-player c32) (clear c33)
   goals met: 1 of 2
6. (move c32 c31 left)
   deleted: (at-player c32) (clear c31)
   added: (at-player c31) (clear c32)
   goals met: 1 of 2
7. (move c31 c21 up)
   deleted: (at-player c31) (clear c21)
   added: (at-player c21) (clear c31)
   goals met: 1 of 2
8. (move c21 c11 up)
   deleted: (at-player c21) (clear c11)
   added: (at-player c11) (clear c21)
   goals met: 1 of 2
9. (move c11 c12 right)
   deleted: (at-player c11) (clear c12)
   added: (at-player c12) (clear c11)
   goals met: 1 of 2
10. (push c12 c22 c32 b1 down)
   deleted: (at-player c12) (at b1 c22) (clear c32)
   added: (at-player c22) (clear c12) (at b1 c32)
   goals met: 1 of 2
11. (push c22 c32 c42 b1 down)
   deleted: (at-player c22) (at b1 c32) (clear c42)
   added: (at-player c32) (clear c22) (at b1 c42)
   goals met: 2 of 2
